codebje/ezpz/stm32-usb/uLisp/Src/ulisp.c
object *fn_out(object *args, object *env)
{
	int port = checkinteger(ZDI_OUT, first(args));
	int value = checkinteger(ZDI_OUT, second(args));
	zdi_out(port, value);
	return nil;
}

object *fn_zdi_exec(object *args, object *env)
{
	uint8_t opcodes[5];
	int count;

	opcodes[0] = checkinteger(ZDI_EXEC, first(args));

	for (count = 1, args = cdr(args); count < 5 && args != NULL; count++, args = cdr(args)) {
		opcodes[count] = checkinteger(ZDI_EXEC, first(args));
	}
	zdi_exec(opcodes, count);
	return nil;
}

object *fn_zdi_status(object *args, object *env)
{
	zdi_status();
	return nil;	// TODO return status as an integer?
}

object *fn_zdi_reg(object *args, object *env)
{
	zdi_registers();
	return nil;
}

object *fn_zdi_stk(object *args, object *env)
{
	int depth = (first(args) == NULL) ? 10 : checkinteger(ZDI_STACK, first(args));
	zdi_stacktrace(depth);
	return nil;
}

object *fn_zdi_stop(object *args, object *env)
{
	zdi_stop();
	return nil;
}

object *fn_zdi_run(object *args, object *env)
{
	zdi_run();
	return nil;
}

object *fn_zdi_brk(object *args, object *env)
{
	if (args == NULL) {
		// list breakpoints
		for (int i = 0; i < 4; i++) {
			uint32_t bkpt = zdi_get_break(i);
			if (bkpt <= 0xffffff) {
				printf("#%d: %06lx\r\n", i, bkpt);
			}
		}
	} else {
		int bpnum = checkinteger(ZDI_BRK, first(args));
		if (bpnum < 0 || bpnum > 3) {
			printf("bpnum should be between 0 and 3\r\n");
		} else if (cdr(args) != NULL) {
			zdi_set_break(bpnum, checkinteger(ZDI_BRK, second(args)));
		} else {
			zdi_clear_break(bpnum);
		}
	}

	return nil;
}

object *fn_zdi_step(object *args, object *env)
{
	zdi_stepinto();
	return nil;
}

object *fn_zdi_over(object *args, object *env)
{
	zdi_stepover();
	return nil;
}

object *fn_zdi_until(object *args, object *env)
{
	int address = checkinteger(ZDI_UNTIL, first(args));
	zdi_stepuntil(address);
	return nil;
}

object *fn_zdi_mem(object *args, object *env)
{
	int address = checkinteger(ZDI_MEM, first(args));
	zdi_memdump(address);
	return nil;
}

// Built-in procedure names - stored in PROGMEM

const char string0[] PROGMEM = "nil";
const char string1[] PROGMEM = "t";
const char string2[] PROGMEM = "nothing";
const char string3[] PROGMEM = "&optional";
const char string4[] PROGMEM = ":initial-element";
const char string5[] PROGMEM = ":element-type";
const char string6[] PROGMEM = "bit";
const char string7[] PROGMEM = "&rest";
const char string8[] PROGMEM = "lambda";
const char string9[] PROGMEM = "let";
const char string10[] PROGMEM = "let*";
const char string11[] PROGMEM = "closure";
const char string12[] PROGMEM = "";
const char string13[] PROGMEM = "quote";
const char string14[] PROGMEM = "defun";
const char string15[] PROGMEM = "defvar";
const char string16[] PROGMEM = "setq";
const char string17[] PROGMEM = "loop";
const char string18[] PROGMEM = "return";
const char string19[] PROGMEM = "push";
const char string20[] PROGMEM = "pop";
const char string21[] PROGMEM = "incf";
const char string22[] PROGMEM = "decf";
const char string23[] PROGMEM = "setf";
const char string24[] PROGMEM = "dolist";
const char string25[] PROGMEM = "dotimes";
const char string26[] PROGMEM = "trace";
const char string27[] PROGMEM = "untrace";
const char string28[] PROGMEM = "for-millis";
const char string35[] PROGMEM = "defcode";
const char string36[] PROGMEM = "";
const char string37[] PROGMEM = "progn";
const char string38[] PROGMEM = "if";
const char string39[] PROGMEM = "cond";
const char string40[] PROGMEM = "when";
const char string41[] PROGMEM = "unless";
const char string42[] PROGMEM = "case";
const char string43[] PROGMEM = "and";
const char string44[] PROGMEM = "or";
const char string45[] PROGMEM = "";
const char string46[] PROGMEM = "not";
const char string47[] PROGMEM = "null";
const char string48[] PROGMEM = "cons";
const char string49[] PROGMEM = "atom";
const char string50[] PROGMEM = "listp";
const char string51[] PROGMEM = "consp";
const char string52[] PROGMEM = "symbolp";
const char string53[] PROGMEM = "arrayp";
const char string54[] PROGMEM = "boundp";
const char string55[] PROGMEM = "set";
const char string56[] PROGMEM = "streamp";
const char string57[] PROGMEM = "eq";
const char string58[] PROGMEM = "car";
const char string59[] PROGMEM = "first";
const char string60[] PROGMEM = "cdr";
const char string61[] PROGMEM = "rest";
const char string62[] PROGMEM = "caar";
const char string63[] PROGMEM = "cadr";
const char string64[] PROGMEM = "second";
const char string65[] PROGMEM = "cdar";
const char string66[] PROGMEM = "cddr";
const char string67[] PROGMEM = "caaar";
const char string68[] PROGMEM = "caadr";
const char string69[] PROGMEM = "cadar";
const char string70[] PROGMEM = "caddr";
const char string71[] PROGMEM = "third";
const char string72[] PROGMEM = "cdaar";
const char string73[] PROGMEM = "cdadr";
const char string74[] PROGMEM = "cddar";
const char string75[] PROGMEM = "cdddr";
const char string76[] PROGMEM = "length";
const char string77[] PROGMEM = "array-dimensions";
const char string78[] PROGMEM = "list";
const char string79[] PROGMEM = "make-array";
const char string80[] PROGMEM = "reverse";
const char string81[] PROGMEM = "nth";
const char string82[] PROGMEM = "aref";
const char string83[] PROGMEM = "assoc";
const char string84[] PROGMEM = "member";
const char string85[] PROGMEM = "apply";
const char string86[] PROGMEM = "funcall";
const char string87[] PROGMEM = "append";
const char string88[] PROGMEM = "mapc";
const char string89[] PROGMEM = "mapcar";
const char string90[] PROGMEM = "mapcan";
const char string91[] PROGMEM = "+";
const char string92[] PROGMEM = "-";
const char string93[] PROGMEM = "*";
const char string94[] PROGMEM = "/";
const char string95[] PROGMEM = "mod";
const char string96[] PROGMEM = "1+";
const char string97[] PROGMEM = "1-";
const char string98[] PROGMEM = "abs";
const char string99[] PROGMEM = "random";
const char string100[] PROGMEM = "max";
const char string101[] PROGMEM = "min";
const char string102[] PROGMEM = "/=";
const char string103[] PROGMEM = "=";
const char string104[] PROGMEM = "<";
const char string105[] PROGMEM = "<=";
const char string106[] PROGMEM = ">";
const char string107[] PROGMEM = ">=";
const char string108[] PROGMEM = "plusp";
const char string109[] PROGMEM = "minusp";
const char string110[] PROGMEM = "zerop";
const char string111[] PROGMEM = "oddp";
const char string112[] PROGMEM = "evenp";
const char string113[] PROGMEM = "integerp";
const char string114[] PROGMEM = "numberp";
const char string115[] PROGMEM = "float";
const char string116[] PROGMEM = "floatp";
const char string117[] PROGMEM = "sin";
const char string118[] PROGMEM = "cos";
const char string119[] PROGMEM = "tan";
const char string120[] PROGMEM = "asin";
const char string121[] PROGMEM = "acos";
const char string122[] PROGMEM = "atan";
const char string123[] PROGMEM = "sinh";
const char string124[] PROGMEM = "cosh";
const char string125[] PROGMEM = "tanh";
const char string126[] PROGMEM = "exp";
const char string127[] PROGMEM = "sqrt";
const char string128[] PROGMEM = "log";
const char string129[] PROGMEM = "expt";
const char string130[] PROGMEM = "ceiling";
const char string131[] PROGMEM = "floor";
const char string132[] PROGMEM = "truncate";
const char string133[] PROGMEM = "round";
const char string134[] PROGMEM = "char";
const char string135[] PROGMEM = "char-code";
const char string136[] PROGMEM = "code-char";
const char string137[] PROGMEM = "characterp";
const char string138[] PROGMEM = "stringp";
const char string139[] PROGMEM = "string=";
const char string140[] PROGMEM = "string<";
const char string141[] PROGMEM = "string>";
const char string142[] PROGMEM = "sort";
const char string143[] PROGMEM = "string";
const char string144[] PROGMEM = "concatenate";
const char string145[] PROGMEM = "subseq";
const char string146[] PROGMEM = "read-from-string";
const char string147[] PROGMEM = "princ-to-string";
const char string148[] PROGMEM = "prin1-to-string";
const char string149[] PROGMEM = "logand";
const char string150[] PROGMEM = "logior";
const char string151[] PROGMEM = "logxor";
const char string152[] PROGMEM = "lognot";
const char string153[] PROGMEM = "ash";
const char string154[] PROGMEM = "logbitp";
const char string155[] PROGMEM = "eval";
const char string156[] PROGMEM = "globals";
const char string157[] PROGMEM = "locals";
const char string158[] PROGMEM = "makunbound";
const char string159[] PROGMEM = "break";
const char string160[] PROGMEM = "read";
const char string161[] PROGMEM = "prin1";
const char string162[] PROGMEM = "print";
const char string163[] PROGMEM = "princ";
const char string164[] PROGMEM = "terpri";
const char string165[] PROGMEM = "read-byte";
const char string166[] PROGMEM = "read-line";
const char string167[] PROGMEM = "write-byte";
const char string168[] PROGMEM = "write-string";
const char string169[] PROGMEM = "write-line";
const char string171[] PROGMEM = "gc";
const char string184[] PROGMEM = "delay";
const char string185[] PROGMEM = "millis";
const char string186[] PROGMEM = "sleep";
const char string189[] PROGMEM = "pprint";
const char string190[] PROGMEM = "pprintall";
const char string191[] PROGMEM = "format";
const char string212[] PROGMEM = "";
#if defined(CPU_L073)
#elif defined(CPU_ATSAMD21)
const char string215[] PROGMEM = ":input";
const char string216[] PROGMEM = ":input-pullup";
const char string217[] PROGMEM = ":input-pulldown";
const char string218[] PROGMEM = ":output";
const char string219[] PROGMEM = ":ar-default";
const char string220[] PROGMEM = ":ar-internal";
const char string221[] PROGMEM = ":ar-internal1v0";
const char string222[] PROGMEM = ":ar-internal1v65";
const char string223[] PROGMEM = ":ar-internal2v23";
const char string224[] PROGMEM = ":ar-external";
const char string225[] PROGMEM = "";
#elif defined(CPU_ATSAMD51)
const char string215[] PROGMEM = ":input";
const char string216[] PROGMEM = ":input-pullup";
const char string217[] PROGMEM = ":input-pulldown";
const char string218[] PROGMEM = ":output";
const char string219[] PROGMEM = ":ar-internal1v0";
const char string220[] PROGMEM = ":ar-internal1v1";
const char string221[] PROGMEM = ":ar-internal1v2";
const char string222[] PROGMEM = ":ar-internal1v25";
const char string223[] PROGMEM = ":ar-internal2v0";
const char string224[] PROGMEM = ":ar-internal2v2";
const char string225[] PROGMEM = ":ar-internal2v23";
const char string226[] PROGMEM = ":ar-internal2v4";
const char string227[] PROGMEM = ":ar-internal2v5";
const char string228[] PROGMEM = ":ar-internal1v65";
const char string229[] PROGMEM = ":ar-external";
const char string230[] PROGMEM = "";
#elif defined(CPU_NRF51822)
const char string215[] PROGMEM = ":input";
const char string216[] PROGMEM = ":input-pullup";
const char string217[] PROGMEM = ":input-pulldown";
const char string218[] PROGMEM = ":output";
const char string219[] PROGMEM = ":ar-default";
const char string220[] PROGMEM = ":ar-vbg";
const char string221[] PROGMEM = ":ar-supply-one-half";
const char string222[] PROGMEM = ":ar-supply-one-third";
const char string223[] PROGMEM = ":ar-ext0";
const char string224[] PROGMEM = ":ar-ext1";
const char string225[] PROGMEM = "";
#elif defined(CPU_NRF52840)
const char string215[] PROGMEM = ":input";
const char string216[] PROGMEM = ":input-pullup";
const char string217[] PROGMEM = ":input-pulldown";
const char string218[] PROGMEM = ":output";
const char string219[] PROGMEM = ":ar-default";
const char string220[] PROGMEM = ":ar-internal";
const char string221[] PROGMEM = ":ar-internal-3-0";
const char string222[] PROGMEM = ":ar-internal-2-4";
const char string223[] PROGMEM = ":ar-internal-1-8";
const char string224[] PROGMEM = ":ar-internal-1-2";
const char string225[] PROGMEM = ":ar-vdd4";
const char string226[] PROGMEM = "";
#elif defined(CPU_NRF52833)
const char string215[] PROGMEM = ":input";
const char string216[] PROGMEM = ":input-pullup";
const char string217[] PROGMEM = ":input-pulldown";
const char string218[] PROGMEM = ":output";
const char string219[] PROGMEM = ":ar-default";
const char string220[] PROGMEM = ":ar-internal";
const char string221[] PROGMEM = ":ar-vdd4";
const char string222[] PROGMEM = "";
#elif defined(CPU_iMXRT1062)
const char string215[] PROGMEM = ":input";
const char string216[] PROGMEM = ":input-pullup";
const char string217[] PROGMEM = ":input-pulldown";
const char string218[] PROGMEM = ":output";
const char string219[] PROGMEM = ":output-opendrain";
const char string220[] PROGMEM = "";
#elif defined(CPU_MAX32620)
const char string215[] PROGMEM = ":input";
const char string216[] PROGMEM = ":input-pullup";
const char string217[] PROGMEM = ":output";
const char string218[] PROGMEM = ":default";
const char string219[] PROGMEM = ":external";
const char string220[] PROGMEM = "";
#endif

