codebje/ezpz/stm32-usb/uLisp/Src/ulisp.c
// Third parameter is no. of arguments; 1st hex digit is min, 2nd hex digit is max, 0xF is unlimited
const tbl_entry_t lookup_table[] PROGMEM = {
  { string0, NULL, 0x00 },
  { string1, NULL, 0x00 },
  { string2, NULL, 0x00 },
  { string3, NULL, 0x00 },
  { string4, NULL, 0x00 },
  { string5, NULL, 0x00 },
  { string6, NULL, 0x00 },
  { string7, NULL, 0x00 },
  { string8, NULL, 0x0F },
  { string9, NULL, 0x0F },
  { string10, NULL, 0x0F },
  { string11, NULL, 0x0F },
  { string12, NULL, 0x00 },
  { string13, sp_quote, 0x11 },
  { string14, sp_defun, 0x2F },
  { string15, sp_defvar, 0x12 },
  { string16, sp_setq, 0x2F },
  { string17, sp_loop, 0x0F },
  { string18, sp_return, 0x0F },
  { string19, sp_push, 0x22 },
  { string20, sp_pop, 0x11 },
  { string21, sp_incf, 0x12 },
  { string22, sp_decf, 0x12 },
  { string23, sp_setf, 0x2F },
  { string24, sp_dolist, 0x1F },
  { string25, sp_dotimes, 0x1F },
  { string26, sp_trace, 0x01 },
  { string27, sp_untrace, 0x01 },
  { string28, sp_formillis, 0x1F },
  { string35, sp_defcode, 0x0F },
  { string36, NULL, 0x00 },
  { string37, tf_progn, 0x0F },
  { string38, tf_if, 0x23 },
  { string39, tf_cond, 0x0F },
  { string40, tf_when, 0x1F },
  { string41, tf_unless, 0x1F },
  { string42, tf_case, 0x1F },
  { string43, tf_and, 0x0F },
  { string44, tf_or, 0x0F },
  { string45, NULL, 0x00 },
  { string46, fn_not, 0x11 },
  { string47, fn_not, 0x11 },
  { string48, fn_cons, 0x22 },
  { string49, fn_atom, 0x11 },
  { string50, fn_listp, 0x11 },
  { string51, fn_consp, 0x11 },
  { string52, fn_symbolp, 0x11 },
  { string53, fn_arrayp, 0x11 },
  { string54, fn_boundp, 0x11 },
  { string55, fn_setfn, 0x2F },
  { string56, fn_streamp, 0x11 },
  { string57, fn_eq, 0x22 },
  { string58, fn_car, 0x11 },
  { string59, fn_car, 0x11 },
  { string60, fn_cdr, 0x11 },
  { string61, fn_cdr, 0x11 },
  { string62, fn_caar, 0x11 },
  { string63, fn_cadr, 0x11 },
  { string64, fn_cadr, 0x11 },
  { string65, fn_cdar, 0x11 },
  { string66, fn_cddr, 0x11 },
  { string67, fn_caaar, 0x11 },
  { string68, fn_caadr, 0x11 },
  { string69, fn_cadar, 0x11 },
  { string70, fn_caddr, 0x11 },
  { string71, fn_caddr, 0x11 },
  { string72, fn_cdaar, 0x11 },
  { string73, fn_cdadr, 0x11 },
  { string74, fn_cddar, 0x11 },
  { string75, fn_cdddr, 0x11 },
  { string76, fn_length, 0x11 },
  { string77, fn_arraydimensions, 0x11 },
  { string78, fn_list, 0x0F },
  { string79, fn_makearray, 0x15 },
  { string80, fn_reverse, 0x11 },
  { string81, fn_nth, 0x22 },
  { string82, fn_aref, 0x2F },
  { string83, fn_assoc, 0x22 },
  { string84, fn_member, 0x22 },
  { string85, fn_apply, 0x2F },
  { string86, fn_funcall, 0x1F },
  { string87, fn_append, 0x0F },
  { string88, fn_mapc, 0x2F },
  { string89, fn_mapcar, 0x2F },
  { string90, fn_mapcan, 0x2F },
  { string91, fn_add, 0x0F },
  { string92, fn_subtract, 0x1F },
  { string93, fn_multiply, 0x0F },
  { string94, fn_divide, 0x1F },
  { string95, fn_mod, 0x22 },
  { string96, fn_oneplus, 0x11 },
  { string97, fn_oneminus, 0x11 },
  { string98, fn_abs, 0x11 },
  { string99, fn_random, 0x11 },
  { string100, fn_maxfn, 0x1F },
  { string101, fn_minfn, 0x1F },
  { string102, fn_noteq, 0x1F },
  { string103, fn_numeq, 0x1F },
  { string104, fn_less, 0x1F },
  { string105, fn_lesseq, 0x1F },
  { string106, fn_greater, 0x1F },
  { string107, fn_greatereq, 0x1F },
  { string108, fn_plusp, 0x11 },
  { string109, fn_minusp, 0x11 },
  { string110, fn_zerop, 0x11 },
  { string111, fn_oddp, 0x11 },
  { string112, fn_evenp, 0x11 },
  { string113, fn_integerp, 0x11 },
  { string114, fn_numberp, 0x11 },
  { string115, fn_floatfn, 0x11 },
  { string116, fn_floatp, 0x11 },
  { string117, fn_sin, 0x11 },
  { string118, fn_cos, 0x11 },
  { string119, fn_tan, 0x11 },
  { string120, fn_asin, 0x11 },
  { string121, fn_acos, 0x11 },
  { string122, fn_atan, 0x12 },
  { string123, fn_sinh, 0x11 },
  { string124, fn_cosh, 0x11 },
  { string125, fn_tanh, 0x11 },
  { string126, fn_exp, 0x11 },
  { string127, fn_sqrt, 0x11 },
  { string128, fn_log, 0x12 },
  { string129, fn_expt, 0x22 },
  { string130, fn_ceiling, 0x12 },
  { string131, fn_floor, 0x12 },
  { string132, fn_truncate, 0x12 },
  { string133, fn_round, 0x12 },
  { string134, fn_char, 0x22 },
  { string135, fn_charcode, 0x11 },
  { string136, fn_codechar, 0x11 },
  { string137, fn_characterp, 0x11 },
  { string138, fn_stringp, 0x11 },
  { string139, fn_stringeq, 0x22 },
  { string140, fn_stringless, 0x22 },
  { string141, fn_stringgreater, 0x22 },
  { string142, fn_sort, 0x22 },
  { string143, fn_stringfn, 0x11 },
  { string144, fn_concatenate, 0x1F },
  { string145, fn_subseq, 0x23 },
  { string146, fn_readfromstring, 0x11 },
  { string147, fn_princtostring, 0x11 },
  { string148, fn_prin1tostring, 0x11 },
  { string149, fn_logand, 0x0F },
  { string150, fn_logior, 0x0F },
  { string151, fn_logxor, 0x0F },
  { string152, fn_lognot, 0x11 },
  { string153, fn_ash, 0x22 },
  { string154, fn_logbitp, 0x22 },
  { string155, fn_eval, 0x11 },
  { string156, fn_globals, 0x00 },
  { string157, fn_locals, 0x00 },
  { string158, fn_makunbound, 0x11 },
  { string159, fn_break, 0x00 },
  { string160, fn_read, 0x01 },
  { string161, fn_prin1, 0x12 },
  { string162, fn_print, 0x12 },
  { string163, fn_princ, 0x12 },
  { string164, fn_terpri, 0x01 },
  { string165, fn_readbyte, 0x02 },
  { string166, fn_readline, 0x01 },
  { string167, fn_writebyte, 0x12 },
  { string168, fn_writestring, 0x12 },
  { string169, fn_writeline, 0x12 },
  { string171, fn_gc, 0x00 },
  { string184, fn_delay, 0x11 },
  { string185, fn_millis, 0x00 },
  { string186, fn_sleep, 0x11 },
  { string189, fn_pprint, 0x12 },
  { string190, fn_pprintall, 0x01 },
  { string191, fn_format, 0x2F },
  { string212, NULL, 0x00 },
#if defined(CPU_L073)
  { "zdi?", fn_zdi_read, 0x11 },
  { "zdi!", fn_zdi_write, 0x22 },
  { "in", fn_in, 0x11 },
  { "out", fn_out, 0x22 },
  { "status", fn_zdi_status, 0x00 },
  { "regs", fn_zdi_reg, 0x00 },
  { "stack", fn_zdi_stk, 0x01 },
  { "exec", fn_zdi_exec, 0x15 },
  { "stop", fn_zdi_stop, 0x00 },
  { "run", fn_zdi_run, 0x00 },
  { "brk", fn_zdi_brk, 0x02 },
  { "step", fn_zdi_step, 0x00 },
  { "over", fn_zdi_over, 0x00 },
  { "until", fn_zdi_until, 0x11 },
  { "mem", fn_zdi_mem, 0x11 },
  { "ihexload", fn_ihex_load, 0x00 },
  { "", NULL, 0x00 },
#elif defined(CPU_ATSAMD21)
  { string215, (fn_ptr_type)INPUT, PINMODE },
  { string216, (fn_ptr_type)INPUT_PULLUP, PINMODE },
  { string217, (fn_ptr_type)INPUT_PULLDOWN, PINMODE },
  { string218, (fn_ptr_type)OUTPUT, PINMODE },
  { string219, (fn_ptr_type)AR_DEFAULT, ANALOGREFERENCE },
  { string220, (fn_ptr_type)AR_INTERNAL, ANALOGREFERENCE },
  { string221, (fn_ptr_type)AR_INTERNAL1V0, ANALOGREFERENCE },
  { string222, (fn_ptr_type)AR_INTERNAL1V65, ANALOGREFERENCE },
  { string223, (fn_ptr_type)AR_INTERNAL2V23, ANALOGREFERENCE },
  { string224, (fn_ptr_type)AR_EXTERNAL, ANALOGREFERENCE },
  { string225, NULL, 0x00 },
#elif defined(CPU_ATSAMD51)
  { string215, (fn_ptr_type)INPUT, PINMODE },
  { string216, (fn_ptr_type)INPUT_PULLUP, PINMODE },
  { string217, (fn_ptr_type)INPUT_PULLDOWN, PINMODE },
  { string218, (fn_ptr_type)OUTPUT, PINMODE },
  { string219, (fn_ptr_type)AR_INTERNAL1V0, ANALOGREFERENCE },
  { string220, (fn_ptr_type)AR_INTERNAL1V1, ANALOGREFERENCE },
  { string221, (fn_ptr_type)AR_INTERNAL1V2, ANALOGREFERENCE },
  { string222, (fn_ptr_type)AR_INTERNAL1V25, ANALOGREFERENCE },
  { string223, (fn_ptr_type)AR_INTERNAL2V0, ANALOGREFERENCE },
  { string224, (fn_ptr_type)AR_INTERNAL2V2, ANALOGREFERENCE },
  { string225, (fn_ptr_type)AR_INTERNAL2V23, ANALOGREFERENCE },
  { string226, (fn_ptr_type)AR_INTERNAL2V4, ANALOGREFERENCE },
  { string227, (fn_ptr_type)AR_INTERNAL2V5, ANALOGREFERENCE },
  { string228, (fn_ptr_type)AR_INTERNAL1V65, ANALOGREFERENCE },
  { string229, (fn_ptr_type)AR_EXTERNAL, ANALOGREFERENCE },
  { string230, NULL, 0x00 },
#elif defined(CPU_NRF51822)
  { string215, (fn_ptr_type)INPUT, PINMODE },
  { string216, (fn_ptr_type)INPUT_PULLUP, PINMODE },
  { string217, (fn_ptr_type)INPUT_PULLDOWN, PINMODE },
  { string218, (fn_ptr_type)OUTPUT, PINMODE },
  { string219, (fn_ptr_type)AR_DEFAULT, ANALOGREFERENCE },
  { string220, (fn_ptr_type)AR_VBG, ANALOGREFERENCE },
  { string221, (fn_ptr_type)AR_SUPPLY_ONE_HALF, ANALOGREFERENCE },
  { string222, (fn_ptr_type)AR_SUPPLY_ONE_THIRD, ANALOGREFERENCE },
  { string223, (fn_ptr_type)AR_EXT0, ANALOGREFERENCE },
  { string224, (fn_ptr_type)AR_EXT1, ANALOGREFERENCE },
  { string225, NULL, 0x00 },
#elif defined(CPU_NRF52840)
  { string215, (fn_ptr_type)INPUT, PINMODE },
  { string216, (fn_ptr_type)INPUT_PULLUP, PINMODE },
  { string217, (fn_ptr_type)INPUT_PULLDOWN, PINMODE },
  { string218, (fn_ptr_type)OUTPUT, PINMODE },
  { string219, (fn_ptr_type)AR_DEFAULT, ANALOGREFERENCE },
  { string220, (fn_ptr_type)AR_INTERNAL, ANALOGREFERENCE },
  { string221, (fn_ptr_type)AR_INTERNAL_3_0, ANALOGREFERENCE },
  { string222, (fn_ptr_type)AR_INTERNAL_2_4, ANALOGREFERENCE },
  { string223, (fn_ptr_type)AR_INTERNAL_1_8, ANALOGREFERENCE },
  { string224, (fn_ptr_type)AR_INTERNAL_1_2, ANALOGREFERENCE },
  { string225, (fn_ptr_type)AR_VDD4, ANALOGREFERENCE },
  { string226, NULL, 0x00 },
#elif defined(CPU_NRF52833)
  { string215, (fn_ptr_type)INPUT, PINMODE },
  { string216, (fn_ptr_type)INPUT_PULLUP, PINMODE },
  { string217, (fn_ptr_type)INPUT_PULLDOWN, PINMODE },
  { string218, (fn_ptr_type)OUTPUT, PINMODE },
  { string219, (fn_ptr_type)AR_DEFAULT, ANALOGREFERENCE },
  { string220, (fn_ptr_type)AR_INTERNAL, ANALOGREFERENCE },
  { string221, (fn_ptr_type)AR_VDD4, ANALOGREFERENCE },
  { string222, NULL, 0x00 },
#elif defined(CPU_iMXRT1062)
  { string215, (fn_ptr_type)INPUT, PINMODE },
  { string216, (fn_ptr_type)INPUT_PULLUP, PINMODE },
  { string217, (fn_ptr_type)INPUT_PULLDOWN, PINMODE },
  { string218, (fn_ptr_type)OUTPUT, PINMODE },
  { string219, (fn_ptr_type)OUTPUT_OPENDRAIN, PINMODE },
  { string220, NULL, 0x00 },
#elif defined(CPU_MAX32620)
  { string215, (fn_ptr_type)INPUT, PINMODE },
  { string216, (fn_ptr_type)INPUT_PULLUP, PINMODE },
  { string217, (fn_ptr_type)OUTPUT, PINMODE },
  { string218, (fn_ptr_type)DEFAULT, ANALOGREFERENCE },
  { string219, (fn_ptr_type)EXTERNAL, ANALOGREFERENCE },
  { string220, NULL, 0x00 },
#endif
};

// Table lookup functions

int builtin (char* n) {
  int entry = 0;
  while (entry < ENDFUNCTIONS) {
    if (strcasecmp(n, (char*)lookup_table[entry].string) == 0)
      return entry;
    entry++;
  }
  return ENDFUNCTIONS;
}

int longsymbol (char *buffer) {
  char *p = SymbolTable;
  int i = 0;
  while (strcasecmp(p, buffer) != 0) {p = p + strlen(p) + 1; i++; }
  if (p == buffer) {
    // Add to symbol table?
    char *newtop = SymbolTop + strlen(p) + 1;
    if (SYMBOLTABLESIZE - (newtop - SymbolTable) < BUFFERSIZE) error2(0, PSTR("symbol table full"));
    SymbolTop = newtop;
  }
  return i + MAXSYMBOL; // First number unused by radix40
}

intptr_t lookupfn (symbol_t name) {
  return (intptr_t)lookup_table[name].fptr;
}

uint8_t getminmax (symbol_t name) {
  uint8_t minmax = lookup_table[name].minmax;
  return minmax;
}

void checkminmax (symbol_t name, int nargs) {
  uint8_t minmax = getminmax(name);
  if (nargs<(minmax >> 4)) error2(name, toofewargs);
  if ((minmax & 0x0f) != 0x0f && nargs>(minmax & 0x0f)) error2(name, toomanyargs);
}

